Revit 2027 API
HorizontalCurveEndpoint.PreviousCurveType Property
 The HorizontalCurveType of the curve which connects the endpoint to the previous displayed curve. If this endpoint's Station equals DisplayedStartStation, returns Unknown curve type.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HorizontalCurveType PreviousCurveType { get; }
Public ReadOnly Property PreviousCurveType As HorizontalCurveType
	Get
public:
property HorizontalCurveType PreviousCurveType {
	HorizontalCurveType get ();
}
member PreviousCurveType : HorizontalCurveType with get
Property Value
HorizontalCurveType
See Also
Reference
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace